# Taps
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'delta'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'ripgrep'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn' # Needed to install fonts

# Development
brew 'monogosh'
brew 'n'

# Apps
cask 'bitwarden'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'jordanbaird-ice'
cask 'MonitorControl'
cask 'pastebot'
cask 'zed'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-sauce-code-pro-nerd-font'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
